tap "homebrew/bundle"
tap "railwaycat/emacsmacport"
brew "xz"
brew "python@3.11"
brew "awscli"
brew "python@3.12"
brew "glib"
brew "cmake"
brew "coreutils"
brew "fd"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "graphviz"
brew "htop"
brew "httpie"
brew "libheif"
brew "liblqr"
brew "imagemagick"
brew "jq"
brew "ldns"
brew "mas"
brew "nmap"
brew "openssl@1.1"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "terraform"
brew "tldr"
brew "tmux"
brew "watch"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "railwaycat/emacsmacport/emacs-mac"
cask "1password"
cask "1password-cli"
cask "docker"
cask "mullvadvpn"
cask "postico"
cask "raspberry-pi-imager"
cask "steam"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
