tap "homebrew/bundle"
tap "homebrew/services"

brew "coreutils"
brew "fd"
brew "fzf"
brew "git"
brew "jq"
brew "mas"
brew "openssl@1.1"
brew "ripgrep"
brew "xz"
brew "rsync"
brew "shellcheck"
brew "tmux"
brew "wget"
brew "rbenv"
brew "ruby-build"
brew "postgresql@14"

cask "transmission", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "mullvadvpn", args: { appdir: "/Applications" }

# get installed with
# `brew bundle dump --file=- | grep ^mas`
# search with
# `mas search [app-name]`
mas "1Password for Safari", id: 1569813296
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
